const story = {
    start: {
      text: "Рицар Готик - починаючий молодий лицар, повний рішучості проявити себе, у нього гаряче серце, гарячий розум... все гаряче, тому він часто потрапляє у неприємності, небезпечні ситуації, конфлікти, бійки, поножовщини і мутні справи. Автор дивується, як він взагалі досі живий, мабуть користується сейв-лоадом, а гра через одне життя то надто складно для молодого мандрівника... Так і живемо... сейв-лоад, сейв-лоад, сейв...лоад... А потім дивуємося, що ігри нудні!",
      img: "/img/gotick.jpg",
      options: [
        { text: "Продовжити", next: "hero" },
        { text: "Вийти на фіг з цієї тупої гри. Автор ти нікчема! ідея тупа! код кривий! а ти баран!", next: "fail" }
      ]
    },
    hero: {
      text: "Рицар Готик зараз в лісі, шукає пригод, скарбів і експи. У світі де живе наш герой, у лісах повно всілякого народу - гоблінів там, розбійників, мисливців, браконьєрів, вовків і зайців. За данним від Писармагстатистик, у лісі щільність населення перевищує міську у 10 разів",
      img: "/public/img/forest2.jpg",
      options: [
        { text: "Зайти у ліві кущі", next: "leftside" },
        { text: "Зайти у праві кущі", next: "rightside" },
        { text: "Зайти кущі напроти", next: "strengthSide", inventory: ["гриб", "трава"],},
        { text: "Зайнятися табором", next: "camp" },
        { text: "Повернутись назад", next: "warning" }
      ]
    },
    camp:{
        text: "Якщо у вас є гриб або лікавальна трава, тоді можете поїсти і полікуватися, демка на цьому все.",
        img: "img/camp.jpg",
      options: [
        { text: "Гриби є", next: "finish" },
        { text: "Піду пошукаю гриби", next: "hero" },
      ]
    },
    finish:{
        text: "Ви посмажили грибочок і поїли.Кінець демо.",
        img: "img/end.jpg",
        options: [
          { text: "Дякую за гру, ти просто чудовий, все супер, давай спочатку", next: "start" },
        ]
    },
    rightside:{
        text: "Перед вами занедбане кладовище, стоїть мертва тиша, земля випалена, а дерева пожовтіли",
        img: "img/cemetery.jpg",
        options: [
          { text: "Зайти на кладовище у пошуках скарбів", next: "cvyntar" },
          { text: "Ну нафіг, я назад", next: "hero" },
        ]
    },
    cvyntar:{
        text: "Ви бачите могилу, яку хочете вирити і дістати скарби. Ви йдете до неї потираючи руки від жаги наживи. Як раптом ваша башка тріскається з одного удару скелета, низький рівень у вас щоб по цвинтарях шастати!",
        img: "img/deth.jpg",
        options: [
          { text: "Ресейв", next: "hero" },
          { text: "Тут баланса немає, скулет чітер, тупа гра, я ливаю", next: "fail2" },
        ]
    },
    fail2:{
        text: "Бажаєш допомогти покращити гру, відкритий до пропозицій за номером 097-188-46-78",
        img: "img/hardgoblin.jpg",
        options: [
          { text: "Ладно давай заново", next: "start" },
        ]
    },
    strengthSide:{
        text: <p>
  Перед вами заросла кущами і травою територія, тут не часто ходять шукачі пригод. Ви знайшли <strong>лікувальну траву</strong> і <strong>їстівні гриби.</strong>
</p>,
        img: "img/mushroom.jpg",
        options: [
            { text: "Повернутися назад із припасами", next: "hero" },
          ]
        },
    leftside:{
        text: "Ти бачиш відкриту галявину, а на ній двоє гоблінів сношають третього.",
        img:"img/love.jpg",
        options:[
            {text: "Кайфоломом ніколи не був, тут робити нічого, повертаюся назад", next: "hero"},
        ]
    },
    warning:{
        text: "Куди назад? Нормальні герої йдуть вперед. Пиздуй в кущі!",
        img: "img/warning.jpg",
        options:[
            {text: "Добре, добре, йду вже...", next: "hero"},
            {text: "Я тут головний! Покажи ще раз прекрасного рицаря Готика", next: "start"},
        ]
    },
    fail:{
        text: "Дякую за зворотний відгук, буду намагатися писати краще, всі пропозиції можете надати за телефоном 097-188-46-78.",
        img: "img/goblin.jpg",
        options: [
            {text: "Повернутися до промо)", next: "start"},
            {text: "Повернутися до промо)", next: "start"},
        ]
    },
  };
export default story;  